//******************************************************************************
//*
//* 文 件 名 : 
//* 文件描述 :        
//* 作    者 : 张威/Andon Health CO.Ltd
//* 版    本 : V0.0
//* 日    期 : 
//******************************************************************************
#ifndef __WYZE_SERVICE_H__
#define __WYZE_SERVICE_H__
///*****************************************************************************
///*                         包含文件说明
///*****************************************************************************

///*****************************************************************************
///*                         宏定义区
///*****************************************************************************
#define WYZE_SERVICE_ENABLE   (1)

#if  WYZE_SERVICE_ENABLE

#define UUID_WYZE_SERVICE                               0xFD7B
#define UUID_WYZE_CHARACTERISTIC_WRITEANDNOTIFY         0x0001
#define HANDLE_WYZE_SERVICE                             0x0300
#define HANDLE_WYZE_SERVICE_CHAR_WRITEANDNOTIFY         0x0301
#define HANDLE_WYZE_SERVICE_CHAR_WRITEANDNOTIFY_VAL     0x0302
#define HANDLE_WYZE_SERVICE_CHAR_CFG_DESC               0x0303


///*****************************************************************************
///*                         Strcut结构变量定义区
///*****************************************************************************

///*****************************************************************************
///*                         函数声明区
///*****************************************************************************
void WyzeServiceGattDisConnect(void);
wiced_bt_gatt_status_t WyzeServerReadHandle(uint16_t conn_id, wiced_bt_gatt_read_t * p_read_data);
wiced_bt_gatt_status_t WyzeServerWriteHandle(uint16_t conn_id, wiced_bt_gatt_write_t * p_data);

///*****************************************************************************
///*                         外部全局常量声明区
///*****************************************************************************

///*****************************************************************************
///*                         外部全局变量声明区
///*****************************************************************************

#endif // WYZE_SERVICE_ENABLE

#endif